Repository: ketchup007/kiosk_frontend
Catalog: kiosk_app/translations/*/LC_MESSAGES/messages.po
Languages: pl, uk

source: Failed to get APS state. Please try again.
pl: Nie udało się zaktualizować zamówienia. Prosimy spróbować ponownie.
uk: Не вдалося оновити замовлення. Будь ласка, спробуйте ще раз.

source: Kiosk is not available
pl: Kiosk jest niedostępny
uk: Kiosk недоступний

source: Failed to create order. Please try again.
pl: Nie udało się zaktualizować zamówienia. Prosimy spróbować ponownie.
uk: Не вдалося оновити замовлення. Будь ласка, спробуйте ще раз.

source: This order is no longer active
pl: To zamówienie nie jest już aktywne
uk: Цей замовлення більше не активне

source: Order not found
pl: Strona nie znaleziona
uk: Сторінка не знайдена

source: An error occurred while loading the order page
pl: Wystąpił błąd podczas ładowania strony zamówienia
uk: Виникла помилка під час завантаження сторінки замовлення

source: Invalid input data
pl: Nieprawidłowe dane wejściowe
uk: Неправильні дані

source: Payment processed successfully
pl: Płatność została przetworzona pomyślnie
uk: Оплата успішна!

source: Payment failed
uk: Оплата не вдалася

source: Payment processing failed. Please try again.
uk: Оплата не вдалася. Будь ласка, спробуйте ще раз.

source: Page not found
pl: Strona nie znaleziona
uk: Сторінка не знайдена

source: An unexpected error occurred. Please try again.
pl: Wystąpił nieoczekiwany błąd. Prosimy spróbować ponownie.
uk: Виникла непередбачена помилка. Будь ласка, спробуйте ще раз.

source: Sorry, all products are currently unavailable. Please try again later.
pl: Przepraszamy, wszystkie produkty są obecnie niedostępne. Prosimy spróbować później.
uk: Вибачте, але всі товари в даний момент недоступні. Будь ласка, спробуйте ще раз пізніше.

source: Failed to check product availability. Please try again.
pl: Nie udało się sprawdzić dostępności produktów. Prosimy spróbować ponownie.
uk: Не вдалося додати товар. Будь ласка, спробуйте ще раз.

source: Failed to create order
pl: Nie udało się zaktualizować zamówienia. Prosimy spróbować ponownie.
uk: Не вдалося оновити замовлення. Будь ласка, спробуйте ще раз.

source: Error processing order data
pl: Wystąpił błąd podczas przetwarzania danych zamówienia
uk: Виникла помилка під час обробки даних замовлення

source: Error creating order
pl: Wystąpił błąd podczas tworzenia zamówienia
uk: Виникла помилка під час створення замовлення

source: Error adding item to order
pl: Wystąpił błąd podczas dodawania produktu do zamówienia
uk: Виникла помилка під час додавання товару до замовлення

source: Error removing item from order
pl: Wystąpił błąd podczas usuwania produktu z zamówienia
uk: Виникла помилка під час видалення товару з замовлення

source: Error checking category availability
pl: Wystąpił błąd podczas sprawdzania dostępności kategorii
uk: Виникла помилка під час перевірки доступності категорії

source: Error getting order status
pl: Wystąpił błąd podczas sprawdzania statusu zamówienia
uk: Виникла помилка під час перевірки статусу замовлення

source: Error cancelling order
pl: Wystąpił błąd podczas anulowania zamówienia
uk: Скасувати замовлення

source: 404 - Page not found
pl: 404 - Strona nie znaleziona
uk: 404 - Сторінка не знайдена

source: We're sorry, but the page you're looking for doesn't exist.
pl: Przepraszamy, ale strona, której szukasz, nie istnieje.
uk: Вибачте, але сторінка, яку ви шукаєте, не існує.

source: Return to Home
pl: Powrót do strony głównej
uk: Повернутися на головну

source: Server error
pl: Błąd serwera
uk: Помилка сервера

source: 500 - Server error
pl: 500 - Błąd serwera
uk: 500 - Помилка сервера

source: We're sorry, but a server error occurred. Please try again later.
pl: Przepraszamy, wystąpił błąd serwera. Prosimy spróbować ponownie później.
uk: Вибачте, але сталася помилка сервера. Будь ласка, спробуйте ще раз пізніше.

source: Estimated waiting time:
uk: Оцінка часу очікування:

source: min
uk: хв

source: Touch Screen to Order
pl: Dotknij ekranu, aby zamówić
uk: Натисни екран, щоб замовити

source: Kiosk is temporarily unavailable
pl: Kiosk jest tymczasowo niedostępny
uk: Kiosk є тимчасово недоступний

source: Kiosk is experiencing technical difficulties
pl: Kiosk ma problemy techniczne
uk: Kiosk має технічні проблеми

source: Kiosk is being restocked
pl: Kiosk jest w trakcie uzupełniania
uk: Kiosk є в процесі поповнення

source: Estimated waiting time: %(time)d min
uk: Оцінка часу очікування: %(time)d хв

source: Snacks
pl: Przekąski
uk: Закуски

source: Drinks
pl: Napoje
uk: Напої

source: Coffee
pl: Kawa
uk: Кава

source: Take Away
pl: Na wynos
uk: З собою

source: Sauces
pl: Sosy
uk: Соуси

source: Summary
pl: Podsumowanie zamówienia
uk: Сума замовлення

source: Allergens
pl: Alergeny
uk: Алергени

source: Price
pl: Cena
uk: Ціна

source: PLN
pl: zł
uk: грн

source: Total
pl: Łączna cena
uk: Загальна сума:

source: Are you sure you want to cancel your order?
pl: Jesteś pewny, że chcesz anulować swoje zamówienie?
uk: Ви впевнені, що хочете скасувати замовлення?

source: Order cancelled successfully
pl: Produkt został dodany pomyślnie
uk: Оплата успішна!

source: Failed to cancel order
pl: Anuluj zamówienie
uk: Скасувати замовлення

source: Cancel
pl: Anuluj
uk: Скасувати

source: Total: %(total).2f %(currency)s
uk: Загальна сума: %(total).2f грн

source: Please add items to your order before proceeding.
pl: Prosimy dodać produkty do swojego zamówienia przed kontynuowaniem.
uk: Будь ласка, додайте товари до свого замовлення перед продовженням.

source: You have been inactive for a while. Do you want to continue your order?
pl: Jesteś nieaktywny od jakiś czasu. Chcesz kontynuować swoje zamówienie?
uk: Ви були неактивними для деякого часу. Ви хочете продовжити своє замовлення?

source: Order Confirmed
pl: Zamówienie zatwierdzone
uk: Замовлення підтверджено

source: Order Number: %(number)s
uk: Номер замовлення: %(number)s

source: Order Details
pl: Szczegóły zamówienia
uk: Деталі замовлення

source: Please pick up your order when your number is called.
pl: Prosimy o podjęcie swojego zamówienia, gdy zostanie wywołany twój numer.
uk: Будь ласка, заберіть своє замовлення, коли ваш номер буде викликаний.

source: Order Summary
pl: Podsumowanie zamówienia
uk: Сума замовлення

source: Price: %(price).2f
uk: Ціна: %(price).2f

source: Suggested Products
uk: Рекомендовані товари

source: Total:
uk: Загальна сума:

source: Cancel Order
uk: Скасувати замовлення

source: Proceed to Payment
uk: Перейти до оплати

source: Failed to update order. Please try again.
uk: Не вдалося оновити замовлення. Будь ласка, спробуйте ще раз.

source: Failed to add product. Please try again.
uk: Не вдалося додати товар. Будь ласка, спробуйте ще раз.

source: Failed to cancel order. Please try again.
uk: Не вдалося скасувати замовлення. Будь ласка, спробуйте ще раз.

source: Total: %(total).2f
uk: Загальна сума: %(total).2f

source: Payment Instructions
pl: Instrukcje płatności
uk: Інструкції для оплати

source: Please follow the instructions on the payment terminal.
pl: Prosimy zgodzić się z instrukcjami na terminalu płatniczym.
uk: Будь ласка, дотримуйтесь інструкцій на терміналі оплати.

source: Cancel Payment
pl: Anuluj płatność
uk: Скасувати оплату

source: Pay %(total).2f
uk: Оплатити %(total).2f

source: Initializing payment...
uk: Ініціалізація оплати...

source: Payment initialization failed. Please try again.
uk: Не вдалося ініціалізувати оплату. Будь ласка, спробуйте ще раз.

source: Processing payment...
uk: Обробка оплати...

source: Payment successful!
uk: Оплата успішна!

source: Payment failed. Please try again.
uk: Оплата не вдалася. Будь ласка, спробуйте ще раз.

source: Are you sure you want to cancel the payment?
uk: Ви впевнені, що хочете скасувати оплату?

source: Failed to cancel payment. Please try again.
uk: Не вдалося скасувати оплату. Будь ласка, спробуйте ще раз.

source: You have been inactive for a while. Do you want to continue your payment?
uk: Ви були неактивними для деякого часу. Ви хочете продовжити свою оплату?

source: Cannot proceed to payment with empty order
pl: Przejdź do płatności

source: An error occurred while loading the payment page
pl: Wystąpił błąd podczas ładowania strony zamówienia

source: Failed to load menu
pl: Nie udało się załadować menu

source: Maximum available quantity reached
pl: Maksymalna dostępna ilość

source: Quantity
pl: Ilość

source: Failed to load order summary
pl: Nie udało się zaktualizować zamówienia. Prosimy spróbować ponownie.

source: Failed to change language
pl: Anuluj zamówienie

source: Estimated waiting time
pl: Przewidywany czas oczekiwania

source: Estimated waiting time %(time)d min
pl: Przewidywany czas oczekiwania %(time)d min

source: Total %(total).2f %(currency)s
pl: Łączna cena %(total).2f zł

source: Order Number %(number)s
pl: Numer zamówienia %(number)s

source: Pay %(total).2f %(currency)s
pl: Łączna cena %(total).2f zł
