Repository: ketchup007/kiosk_frontend
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uk

source: Przepraszamy za niedogodności. Prosimy spróbować później.
uk: Вибачте за незручності. Будь ласка, спробуйте пізніше.

source: Nie można rozpocząć zamówienia. Spróbuj ponownie później.
uk: Неможливо розпочати замовлення. Спробуйте ще раз пізніше.

source: Nie znaleziono aktywnego zamówienia.
uk: Активне замовлення не знайдено.

source: Nie udało się anulować zamówienia. Spróbuj ponownie.
uk: Не вдалося скасувати замовлення. Спробуйте ще раз.

source: Nie udało się zaktualizować zamówienia. Spróbuj ponownie.
uk: Не вдалося оновити замовлення. Спробуйте ще раз.

source: Nie udało się przejść do płatności. Spróbuj ponownie.
uk: Не вдалося перейти до оплати. Спробуйте ще раз.

source: Nie udało się anulować płatności. Spróbuj ponownie.
uk: Не вдалося скасувати оплату. Спробуйте ще раз.

source: Nie udało się pobrać szczegółów zamówienia.
uk: Не вдалося отримати деталі замовлення.

source: Nie udało się zakończyć zamówienia. Spróbuj ponownie.
uk: Не вдалося завершити замовлення. Спробуйте ще раз.

source: Potwierdzenie zamówienia - Kiosk Munchies
uk: Підтвердження замовлення - Кіоск Munchies

source: Potwierdzenie zamówienia
uk: Підтвердження замовлення

source: Numer zamówienia:
uk: Номер замовлення:

source: Szacowany czas oczekiwania:
uk: Орієнтовний час очікування:

source: minut
uk: хвилин

source: Instrukcje odbioru
uk: Інструкції з отримання

source: Prosimy o odebranie zamówienia z okienka numer
uk: Будь ласка, заберіть замовлення з вікна номер

source: Dziękujemy za skorzystanie z naszych usług!
uk: Дякуємо за користування нашими послугами!

source: Powrót do ekranu głównego
uk: Повернутися на головний екран

source: Zamówienie - Kiosk Munchies
uk: Замовлення - Кіоск Munchies

source: Wszystkie
uk: Всі

source: Przekąski
uk: Закуски

source: Napoje
uk: Напої

source: Kawa
uk: Кава

source: Opakowania
uk: Упаковка

source: Sosy
uk: Соуси

source: Anuluj zamówienie
uk: Скасувати замовлення

source: Suma:
uk: Сума:

source: Podsumowanie zamówienia
uk: Підсумок замовлення

source: Podsumowanie zamówienia - Kiosk Munchies
uk: Підсумок замовлення - Кіоск Munchies

source: Sugerowane produkty
uk: Рекомендовані продукти

source: Suma zamówienia:
uk: Сума замовлення:

source: Przejdź do płatności
uk: Перейти до оплати

source: Płatność - Kiosk Munchies
uk: Оплата - Кіоск Munchies

source: Płatność
uk: Оплата

source: Wybierz metodę płatności
uk: Виберіть спосіб оплати

source: Karta płatnicza
uk: Платіжна картка

source: Anuluj płatność
uk: Скасувати оплату

source: Potwierdź płatność
uk: Підтвердити оплату

source: Kiosk Munchies
uk: Кіоск Munchies

source: Dotknij ekranu, aby rozpocząć
uk: Торкніться екрану, щоб почати

source: Kiosk jest chwilowo wyłączony
uk: Кіоск тимчасово недоступний
